Revit 2027 API
RebarShapeDefinitionByArc.AddConstraintSagittaLength Method
 Specify a parameter to drive the sagittal length (the height of the circular segment, measured perpendicular to the chord).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddConstraintSagittaLength(
	ElementId paramId
)
Public Sub AddConstraintSagittaLength (
	paramId As ElementId
)
public:
void AddConstraintSagittaLength(
	ElementId^ paramId
)
member AddConstraintSagittaLength :
        paramId : ElementId -> unit
Parameters
paramId ElementId
 Id of a parameter to drive the constraint. To obtain the id of a shared parameter, call RebarShape.GetElementIdForExternalDefinition().
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 The sagitta will be measured on the centerline of the bar.
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace